[
  {
    "_id": "640f1af12f44e695da1c65dc",
    "review": "its very solid, different what what would be usually taught, I like how we get to practicing right away so that none of the things we learn are lost or forgotten.",
    "rating": 4.2,
    "course": "640f0f46866b0c89f68bd353",
    "user": {
      "_id": "5c8a211f2f8fb814b56fa188",
      "name": "Cristian Vega",
      "photo": "user-9.jpg"
    },
    "createdAt": "2023-03-13T12:45:37.459Z",
    "id": "640f1af12f44e695da1c65dc"
  },
  {
    "_id": "640f1aad2f44e695da1c65cf",
    "review": "The course is a good match for me because I can see that a lot of time was spent on making sure the customer learns how to pronounce the spanish words correctly using the appropriate accent",
    "rating": 3.5,
    "course": "640f0f46866b0c89f68bd353",
    "user": {
      "_id": "5c8a1f4e2f8fb814b56fa185",
      "name": "Jennifer Hardy",
      "photo": "user-6.jpg"
    },
    "createdAt": "2023-03-13T12:44:29.923Z",
    "id": "640f1aad2f44e695da1c65cf"
  },
  {
    "_id": "640f1a8b2f44e695da1c65c2",
    "review": "I would have given it 5 stars, because this was what I was looking for, a complete grammar course and lots of vocabulary learning (you should get speaking practice elsewhere, but for someone who learns independently and needs to learn the grammar this is great) in part 2 it really bugs me as a headphone user that the teacher breathes into the microphone and the plosive sounds are unpleasant to the ear, so that I can't listen to several videos in a row like I used to with Isabella's content.",
    "rating": 4.4,
    "course": "640f0f46866b0c89f68bd353",
    "user": {
      "_id": "5c8a201e2f8fb814b56fa186",
      "name": "Kate Morrison",
      "photo": "user-7.jpg"
    },
    "createdAt": "2023-03-13T12:43:55.476Z",
    "id": "640f1a8b2f44e695da1c65c2"
  },
  {
    "_id": "640f1a5e2f44e695da1c65b5",
    "review": "At first I was unsure how much I liked it but after a while I realized the depth of this class. There's a lot in here and I think it's a great value for the money. And it's organized in nice blocks. (for example I am flying tomorrow, perhaps I will re-listen to the travel section) My wife who is semi-fluent has used many of the sessions to brush up on her Spanish.",
    "rating": 4.9,
    "course": "640f0f46866b0c89f68bd353",
    "user": {
      "_id": "5c8a1dfa2f8fb814b56fa181",
      "name": "Lourdes Browning",
      "photo": "user-2.jpg"
    },
    "createdAt": "2023-03-13T12:43:10.577Z",
    "id": "640f1a5e2f44e695da1c65b5"
  },
  {
    "_id": "640f19b22f44e695da1c657e",
    "review": "The information is good but the speed of the voice is clearly slowed down. I have to modify the playback speed to 2x to actually listen like a normal person. Otherwise it's a great course but it's a shame the teachers slowed down their voice so much.",
    "rating": 2.6,
    "course": "640f0f46866b0c89f68bd32f",
    "user": {
      "_id": "5c8a1dfa2f8fb814b56fa181",
      "name": "Lourdes Browning",
      "photo": "user-2.jpg"
    },
    "createdAt": "2023-03-13T12:40:18.393Z",
    "id": "640f19b22f44e695da1c657e"
  },
  {
    "_id": "640f19862f44e695da1c6574",
    "review": "I started this course with a basic to medium understanding of node.js. This was the perfect course to get a deeper knowledge of node, to understand what is happening behind the scenes, to create clean and modular code... The theory is important to me. Nevertheless, adding more real life examples and challenging exercices would make this course even better. And thanks a lot for the new challenge at the end with the introduction to Typescript and Deno...",
    "rating": 4.2,
    "course": "640f0f46866b0c89f68bd32f",
    "user": {
      "_id": "5c8a1ec62f8fb814b56fa183",
      "name": "Ayla Cornell",
      "photo": "user-4.jpg"
    },
    "createdAt": "2023-03-13T12:39:34.566Z",
    "id": "640f19862f44e695da1c6574"
  },
  {
    "_id": "640f19662f44e695da1c656a",
    "review": "Expected to learn early but in 1.5 x speed it still merrying around the bush in every video. Its more like story telling instead of technical learning video. I finished 2 tutorials on youtube in the duration of 6-7 initial videos even if I jumped all the non sense videos of introduction",
    "rating": 3.4,
    "course": "640f0f46866b0c89f68bd32f",
    "user": {
      "_id": "5c8a1e1a2f8fb814b56fa182",
      "name": "Sophie Louise Hart",
      "photo": "user-3.jpg"
    },
    "createdAt": "2023-03-13T12:39:02.347Z",
    "id": "640f19662f44e695da1c656a"
  },
  {
    "_id": "640f17372f44e695da1c64a2",
    "review": "I have taken all of Luke's courses, and I have to say, they were incredibly valuable. What I appreciate most about these courses is that they are not just about memorizing vocabulary or grammar rules but about changing your approach to learning a language. It's clear that he cares about our progress and success. His heart is in teaching, and he approaches it with the mind of a psychologist. Not only is he incredibly knowledgeable about the English language and its nuances, but he also has a really nice personality and sense of humor. Taking his courses feels like going on a journey of discovery and learning how to enjoy the process of learning English. It's like having a friend who is an experienced traveler and who supports and encourages you throughout the journey. You want to travel with him again and again. I highly recommend his courses to anyone looking for a truly transformative learning experience.",
    "rating": 5,
    "course": "640f0f46866b0c89f68bd34a",
    "user": {
      "_id": "5c8a201e2f8fb814b56fa186",
      "name": "Kate Morrison",
      "photo": "user-7.jpg"
    },
    "createdAt": "2023-03-13T12:29:43.709Z",
    "id": "640f17372f44e695da1c64a2"
  },
  {
    "_id": "640f16ea2f44e695da1c6494",
    "review": "I just started learning this course. But I know pretty well that it will not disappoint me because I have been learning from Luke sir from Last few months. I know he is a great teacher",
    "rating": 4.9,
    "course": "640f0f46866b0c89f68bd34a",
    "user": {
      "_id": "5c8a1f4e2f8fb814b56fa185",
      "name": "Jennifer Hardy",
      "photo": "user-6.jpg"
    },
    "createdAt": "2023-03-13T12:28:26.788Z",
    "id": "640f16ea2f44e695da1c6494"
  },
  {
    "_id": "640f16782f44e695da1c6462",
    "review": "As a new person to programming, I would really appreciate your effort in making the videos and explaining things. Some things could be better explained like Inheritence detail and GUI etc. Overall it was good.",
    "rating": 3.5,
    "course": "640f0f46866b0c89f68bd343",
    "user": {
      "_id": "5c8a1f4e2f8fb814b56fa185",
      "name": "Jennifer Hardy",
      "photo": "user-6.jpg"
    },
    "createdAt": "2023-03-13T12:26:32.598Z",
    "id": "640f16782f44e695da1c6462"
  },
  {
    "_id": "640f15f92f44e695da1c6454",
    "review": "When I started the course I only had brief knowledge of html, css, and javascript. The lecturer did a great job explaining the fundamentals and by the end of Section 6, I was able to start writing scripts on my own. Even though there was a lot of theory that had to be learned, the presenter managed to keep my interest. Thanks to this course I changed my plans for the future and will pursue a career in programming.",
    "rating": 4.3,
    "course": "640f0f46866b0c89f68bd343",
    "user": {
      "_id": "5c8a1dfa2f8fb814b56fa181",
      "name": "Lourdes Browning",
      "photo": "user-2.jpg"
    },
    "createdAt": "2023-03-13T12:24:25.197Z",
    "id": "640f15f92f44e695da1c6454"
  },
  {
    "_id": "640f15c22f44e695da1c6448",
    "review": "This was my first Python course. Really, this was my first course on coding at all and I absolutely loved it. I think Jose is a great instructor. I learned a ton from this course and really came out much more confident. Jose seems to have a lot a really good courses on Udemy. My only gripe is, he doesn’t seem to update them. There are a few new features in Python as of 2023 that I feel would be pertinent to be aware of but this course is still relevant. However, some of his other courses are a little out of date. He teaches you how to download and use the versions of material he is using which is cool, but I think he should add updates.",
    "rating": 4.8,
    "course": "640f0f46866b0c89f68bd343",
    "user": {
      "_id": "5c8a1e1a2f8fb814b56fa182",
      "name": "Sophie Louise Hart",
      "photo": "user-3.jpg"
    },
    "createdAt": "2023-03-13T12:23:30.176Z",
    "id": "640f15c22f44e695da1c6448"
  },
  {
    "_id": "640f14eb2f44e695da1c6412",
    "review": "He gives you a full understanding of React and the other stuff, however, he constantly writes code then erases it multiple times which makes it very confusing. Instead, show one way of doing something, then in the next example, show another way, instead of doing it all in the same example.",
    "rating": 4,
    "course": "640f0f46866b0c89f68bd33b",
    "user": {
      "_id": "5c8a1ec62f8fb814b56fa183",
      "name": "Ayla Cornell",
      "photo": "user-4.jpg"
    },
    "createdAt": "2023-03-13T12:19:55.817Z",
    "id": "640f14eb2f44e695da1c6412"
  },
  {
    "_id": "640f14cc2f44e695da1c6405",
    "review": "Let's wait a little more until the middle of the course then I can rate it better.\nGenerally it is a good course, but in a few lectures and modules the way he teaches is backwards, seems like that he supposed that you already know the final result and depending on that he goes on, which is a little confusing!",
    "rating": 3.5,
    "course": "640f0f46866b0c89f68bd33b",
    "user": {
      "_id": "5c8a211f2f8fb814b56fa188",
      "name": "Cristian Vega",
      "photo": "user-9.jpg"
    },
    "createdAt": "2023-03-13T12:19:24.856Z",
    "id": "640f14cc2f44e695da1c6405"
  },
  {
    "_id": "640f14872f44e695da1c63f8",
    "review": "You can summarize some ideas, keeps repeating is sometimes not good.\nLove the clear example at most cases. BIG RECOMMENDATION: Please organize the course better, I had to tick a lot of items, there was videos that were not exactly along with previous section and it is clearly seen that has been updated.\nI would still recommended and thank you Max and team for preparing these materials, it has significantly helped my knowledge.",
    "rating": 4.4,
    "course": "640f0f46866b0c89f68bd33b",
    "user": {
      "_id": "5c8a21f22f8fb814b56fa18a",
      "name": "Aarav Lynn",
      "photo": "user-11.jpg"
    },
    "createdAt": "2023-03-13T12:18:15.124Z",
    "id": "640f14872f44e695da1c63f8"
  },
  {
    "_id": "640f13e62f44e695da1c63c6",
    "review": "One of the finest resources available to learn gRPC properly. Clear and concise explanation and more hands-on example with practical usage.",
    "rating": 5,
    "course": "640f0f46866b0c89f68bd334",
    "user": {
      "_id": "5c8a21f22f8fb814b56fa18a",
      "name": "Aarav Lynn",
      "photo": "user-11.jpg"
    },
    "createdAt": "2023-03-13T12:15:34.322Z",
    "id": "640f13e62f44e695da1c63c6"
  },
  {
    "_id": "640f13a12f44e695da1c63b1",
    "review": "Good course overall! It gives you the basics of gRPC in nodejs. It should have a section about authentication and authorization.Finally, thank you!",
    "rating": 5,
    "course": "640f0f46866b0c89f68bd334",
    "user": {
      "_id": "5c8a23de2f8fb814b56fa18e",
      "name": "Max Smith",
      "photo": "user-15.jpg"
    },
    "createdAt": "2023-03-13T12:14:25.994Z",
    "id": "640f13a12f44e695da1c63b1"
  },
  {
    "_id": "640f13532f44e695da1c63a5",
    "review": "I highly recommend it. Beginners friendly, and good use of best practices.",
    "rating": 4.9,
    "course": "640f0f46866b0c89f68bd334",
    "user": {
      "_id": "5c8a24282f8fb814b56fa18f",
      "name": "Isabel Kirkland",
      "photo": "user-16.jpg"
    },
    "createdAt": "2023-03-13T12:13:07.726Z",
    "id": "640f13532f44e695da1c63a5"
  },
  {
    "_id": "640f12582f44e695da1c637c",
    "review": "This course is a masterpiece. Course content is outstanding. Instructor is brilliant. I learned a ton about AWS and infrastructure as code. The best part about this course is that everything works.",
    "rating": 4.8,
    "course": "640f0f46866b0c89f68bd334",
    "user": {
      "_id": "5c8a1f4e2f8fb814b56fa185",
      "name": "Jennifer Hardy",
      "photo": "user-6.jpg"
    },
    "createdAt": "2023-03-13T12:08:56.864Z",
    "id": "640f12582f44e695da1c637c"
  }
]
